about-models.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-15 Thu 14:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using a LLM model in Emacs</title>
<meta name="author" content="Jong W. Kim" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using a LLM model in Emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdd76b4a">1. Ellama</a>
<ul>
<li><a href="#org64800b9">1.1. What benefist can we get from Emacs interfaces?</a></li>
<li><a href="#orgee85824">1.2. Install</a></li>
<li><a href="#orga4bcfc9">1.3. Install Ollama</a></li>
<li><a href="#org00da767">1.4. Ollama on Emacs with Ellama</a>
<ul>
<li><a href="#org2b17bfd">1.4.1. About Ellama commands</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgaec6145">2. Test</a>
<ul>
<li><a href="#orgdda1685">2.1. User:</a></li>
<li><a href="#org6114d2c">2.2. Ellama:</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgdd76b4a" class="outline-2">
<h2 id="orgdd76b4a"><span class="section-number-2">1.</span> Ellama</h2>
<div class="outline-text-2" id="text-1">
<p>
Ellama (Emacs Large LAnguage models from Emacs)  is a tool to interact with LLMs from Emacs. In Emacs environment, users can ask questions and get responses from the model.
</p>
</div>

<div id="outline-container-org64800b9" class="outline-3">
<h3 id="org64800b9"><span class="section-number-3">1.1.</span> What benefist can we get from Emacs interfaces?</h3>
</div>

<div id="outline-container-orgee85824" class="outline-3">
<h3 id="orgee85824"><span class="section-number-3">1.2.</span> Install</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Details can be found:  <a href="https://github.com/s-kostyaev/ellama">https://github.com/s-kostyaev/ellama</a>
</p>
</div>
</div>

<div id="outline-container-orga4bcfc9" class="outline-3">
<h3 id="orga4bcfc9"><span class="section-number-3">1.3.</span> Install Ollama</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://github.com/ollama/ollama?tab=readme-ov-file">https://github.com/ollama/ollama?tab=readme-ov-file</a>
</p>
</div>
</div>


<div id="outline-container-org00da767" class="outline-3">
<h3 id="org00da767"><span class="section-number-3">1.4.</span> Ollama on Emacs with Ellama</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Setting up Ollama as a server and Ellama as an Emacs client, leading to a localized AI-driven LLMs with rich experiences of Emacs.
</p>

<p>
Install gemma2 model, with 2B parameters size (1.6GB)
</p>
</div>

<div id="outline-container-org2b17bfd" class="outline-4">
<h4 id="org2b17bfd"><span class="section-number-4">1.4.1.</span> About Ellama commands</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
<a href="https://github.com/s-kostyaev/ellama/blob/main/README.org">https://github.com/s-kostyaev/ellama/blob/main/README.org</a>
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgaec6145" class="outline-2">
<h2 id="orgaec6145"><span class="section-number-2">2.</span> Test</h2>
<div class="outline-text-2" id="text-2">
<p>
M-x shell
</p>

<p>
ollama pull zephyr
</p>


<p>
M-x ellama-chat
</p>

<p>
I asked why is sky blue?
</p>
</div>


<div id="outline-container-orgdda1685" class="outline-3">
<h3 id="orgdda1685"><span class="section-number-3">2.1.</span> User:</h3>
<div class="outline-text-3" id="text-2-1">
<p>
why is sky blue? 
</p>
</div>
</div>

<div id="outline-container-org6114d2c" class="outline-3">
<h3 id="org6114d2c"><span class="section-number-3">2.2.</span> Ellama:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The color of the sky appears to be blue due to a phenomenon called scattering. The Earth's
atmosphere is filled with small gas molecules like nitrogen and oxygen, which scatter light. When
sunlight enters the Earth's atmosphere, it encounters these gas molecules. Since blue light has a
shorter wavelength than other colors of visible light, it gets scattered more than other colors by
the gas molecules in the atmosphere. This is why the sky appears blue to us. The same reason makes
the sun appear reddish during sunrise and sunset when most of the blue light is scattered away,
leaving behind the longer wavelengths of red, orange, and yellow light.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jong W. Kim</p>
<p class="date">Created: 2024-08-15 Thu 14:35</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
